import { generateMatrix } from '/js/generator/taskGenerator';

/**
 * АЛГОРИТМ
 * Етап-1. ЗВЕДЕННЯ МАТРИЦІ
 * 1. Знайти мін елементи по рядках
 * 2. Відняти по рядках
 * 3. Знайти мін елементи по стовпцях
 * 4. Відняти по стовпцях
 *
 * Етап-2. ШТРАФИ
 * 1. Знайти нулі,
 * 2. Обчислити їхні штрафи (мін елемент по рядку + мін елемент по стовпцю)
 * 3. Знайти максимальний штраф (якщо таких декілька, то по меншим індексам)
 * 4. Вивести штраф і його координати (ДОДАТИ ЦІ КООРДИНАТИ В МАСИВ РОКЗЛАДУ)
 *
 * для графу:
 * 1. два масиви: координати і НЕкоординати (тут нижня межа плюс макс штраф)
 *
 * Етап-3.
 * 1. Виключити ребро з максимальним штрафом (заповнити його рядок і стовпець Infinity)
 * 2. Виключити негамільтонові цикли
 * 3. Обчислити мінімальні елементи
 *
 * для графу:
 * 1. два масиви: координати (тут нижня межа плюс сума мінімальних елементів по рядку і стовпцю) і НЕкоординати (тут нижня межа плюс макс штраф)
 *
 * ЕТАП-4
 * 1. Звести матрицю
 */
